int/auto/OWSWSMigration/resources/dataBank/TeamEnv/Req/UpdatePhone_TC001.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://webservices.micros.com/og/4.3/Common/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl">
 <soapenv:Header>
    <OGHeader primaryLangID="E" timeStamp="KEYWORD_GMT_TIMESTAMP" transactionID="1100" xmlns="http://webservices.micros.com/og/4.3/Core/">
       <Origin entityID="PROPCH1" systemType="WEB"/>
       <Destination entityID="TI" systemType="ORS"/>
       <Authentication>
          <UserCredentials>
             <UserName>SUPERVISOR</UserName>
             <UserPassword>SCRUMBIZ10</UserPassword>
             <Domain>NIRMAL</Domain>
          </UserCredentials>
       </Authentication>
    </OGHeader>
 </soapenv:Header>
 <soapenv:Body>
    <name:UpdatePhoneRequest>
       <name:NamePhone operaId="Var_namePhoneOperaId" phoneType="WORK">
          <com:PhoneNumber>1185103655</com:PhoneNumber>
       </name:NamePhone>
    </name:UpdatePhoneRequest>
 </soapenv:Body>
</soapenv:Envelope>